In [1]:
import pandas as pd
import os
import json
import gzip
import numpy as np
import pandas_profiling
from pathlib import Path

In [2]:
path = Path(os.getcwd()).parents[0]

In [3]:
file = os.path.join(path,'data/source')

 The dataset does not come with headers, so it's hard to tell what the data represents. However, someone was able to guess the headers <a href=http://rstudio-pubs-static.s3.amazonaws.com/73039_9946de135c0a49daa7a0a9eda4a67a72.html> here </a>. I used their headers just to make the dataset a little bit easier to interpret.

In [4]:
headers = ['Gender','Age','Debt','Married','Bank Customer','Education Level','Ethnicity','Years Employed','Prior Default','Currently Employed','Credit Score','Drivers License','Citizen','Zip Code','Income','Approved']

In [5]:
df = pd.read_csv(file + '\\crx.data',header=None,names=headers)

In [6]:
df.head()

,Gender,Age,Debt,Married,Bank Customer,Education Level,Ethnicity,Years Employed,Prior Default,Currently Employed,Credit Score,Drivers License,Citizen,Zip Code,Income,Approved
0,b,30.83,0.000,u,g,w,v,1.25,t,t,1,f,g,00202,0,+
1,a,58.67,4.460,u,g,q,h,3.04,t,t,6,f,g,00043,560,+
2,a,24.50,0.500,u,g,q,h,1.50,t,f,0,f,g,00280,824,+
3,b,27.83,1.540,u,g,w,v,3.75,t,t,5,t,g,00100,3,+
4,b,20.17,5.625,u,g,w,v,1.71,t,f,0,f,s,00120,0,+

In [12]:
df.shape

(690, 16)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 690 entries, 0 to 689
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Gender              690 non-null    object
 1   Age                 690 non-null    object
 2   Debt                690 non-null    float64
 3   Married             690 non-null    object
 4   Bank Customer       690 non-null    object
 5   Education Level     690 non-null    object
 6   Ethnicity           690 non-null    object
 7   Years Employed      690 non-null    float64
 8   Prior Default       690 non-null    object
 9   Currently Employed  690 non-null    object
 10  Credit Score        690 non-null    int64
 11  Drivers License     690 non-null    object
 12  Citizen             690 non-null    object
 13  Zip Code            690 non-null    object
 14  Income              690 non-null    int64
 15  Approved            690 non-null    object
dtypes: float64(2), int64(2), object(12)
memory usage: 86.4+ KB

In [14]:
df.describe()

             Debt  Years Employed  Credit Score         Income
count  690.000000      690.000000     690.00000     690.000000
mean     4.758725        2.223406       2.40000    1017.385507
std      4.978163        3.346513       4.86294    5210.102598
min      0.000000        0.000000       0.00000       0.000000
25%      1.000000        0.165000       0.00000       0.000000
50%      2.750000        1.000000       0.00000       5.000000
75%      7.207500        2.625000       3.00000     395.500000
max     28.000000       28.500000      67.00000  100000.000000

In [8]:
for col in df:
    if df[col].dtypes == object:
        print(df[col].value_counts())
        print('--------------------------')
    else:
        continue

b    468
a    210
?     12
Name: Gender, dtype: int64
--------------------------
?        12
22.67     9
20.42     7
25.00     6
22.50     6
         ..
42.17     1
39.42     1
54.42     1
36.58     1
18.50     1
Name: Age, Length: 350, dtype: int64
--------------------------
u    519
y    163
?      6
l      2
Name: Married, dtype: int64
--------------------------
g     519
p     163
?       6
gg      2
Name: Bank Customer, dtype: int64
--------------------------
c     137
q      78
w      64
i      59
aa     54
ff     53
k      51
cc     41
m      38
x      38
d      30
e      25
j      10
?       9
r       3
Name: Education Level, dtype: int64
--------------------------
v     399
h     138
bb     59
ff     57
?       9
j       8
z       8
dd      6
n       4
o       2
Name: Ethnicity, dtype: int64
--------------------------
t    361
f    329
Name: Prior Default, dtype: int64
--------------------------
f    395
t    295
Name: Currently Employed, dtype: int64
--------------------------
f    374
t    316
Name: Drivers License, dtype: int64
--------------------------
g    625
s     57
p      8
Name: Citizen, dtype: int64
--------------------------
00000    132
00120     35
00200     35
00160     34
00100     30
        ...
00167      1
00029      1
00030      1
00510      1
00348      1
Name: Zip Code, Length: 171, dtype: int64
--------------------------
-    383
+    307
Name: Approved, dtype: int64
--------------------------

In [13]:
383/690

0.5550724637681159

There are two interesting takeaways from this. First, there are slightly more rejections than approvals in this dataset. About 55% of the customers were rejected for a credit card. This slight bias in the dataset is something to keep in mind throughout the project.

Second, it looks like the NA values are in the form of '?'. I replaced them with the most common value in each column.

In [10]:
#First I wanted to check how many NAs were in each column
df = df.replace('?',np.NaN)
df.isna().sum()

Gender                12
Age                   12
Debt                   0
Married                6
Bank Customer          6
Education Level        9
Ethnicity              9
Years Employed         0
Prior Default          0
Currently Employed     0
Credit Score           0
Drivers License        0
Citizen                0
Zip Code              13
Income                 0
Approved               0
dtype: int64

In [11]:
for col in df:
     if df[col].dtypes == 'object':
        df = df.fillna(df[col].value_counts().index[0])

print(df.isna().sum())

Gender                0
Age                   0
Debt                  0
Married               0
Bank Customer         0
Education Level       0
Ethnicity             0
Years Employed        0
Prior Default         0
Currently Employed    0
Credit Score          0
Drivers License       0
Citizen               0
Zip Code              0
Income                0
Approved              0
dtype: int64

There wasn't much data wrangling to do with this dataset, as it is fairly clean. Since the data has been completely anonymized, it's hard to tell if there are any mistakes or typos. As far as I can tell, the dataset is ready for EDA.

In [ ]:
df.to_csv(os.path.join(path,'data/processed','DataWranglingOutput.csv'))